// Lab7A.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <windows.h>
using namespace std;

char Compare(int a, int b) {
    if (a > b)
        return '>';
    else if (a < b)
        return '<';
    else
        return '=';
}

int main() {

    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    int x, y;
    int repeat = 1;

    while (repeat == 1) {
        cout << "Введiть перше число -> ";
        cin >> x;

        cout << "Введiть друге число -> ";
        cin >> y;

        char result = Compare(x, y);

        cout << x << " " << result << " " << y << endl;
    }
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
