// lab2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
// Office Microsoft 4 870
// SmartSute Lotus 5 1020
// StarOffice Sun 4 9 

#define _CRT_SECURE_NO_WARNINGS 
#include <iostream>
#include <stdio.h>
#include <windows.h> 
using namespace std;

int main() {

    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    char name1[20], name2[20], name3[20];
    char type1[20], type2[20], type3[20];
    int parts1, parts2, parts3;
    int price1, price2, price3;

    printf("1. Введіть дані для першого офісного пакета (найменування, виробник, кількість частин, ціна) >\n");
    scanf("%s %s %d %d", name1, &type1, &parts1, &price1);

    printf("2. Введіть дані для другого офісного пакета (найменування, виробник, кількість частин, ціна) >\n");
    scanf("%s %s %d %d", name2, &type2, &parts2, &price2);

    printf("3. Введіть дані для третього офісного пакета (найменування, виробник, кількість частин, ціна) >\n");
    scanf("%s %s %d %d", name3, &type3, &parts3, &price3);


    printf("|--------------------------------------------------------------------------|\n");
    printf("| Офісні пакети                                                            |\n");
    printf("|--------------------------------------------------------------------------|\n");
    printf("| %-15s | %-10s | %-28s | %-10s |\n", "Найменування", "Виробник", "Кількість складових частин", "Ціна ($)");
    printf("|--------------------------------------------------------------------------|\n");
    printf("| %-15s | %-10s | %-28d | %-10d |\n", name1, type1, parts1, price1);
    printf("|--------------------------------------------------------------------------|\n");
    printf("| %-15s | %-10s | %-28d | %-10d |\n", name2, type2, parts2, price2);
    printf("|--------------------------------------------------------------------------|\n");
    printf("| %-15s | %-10s | %-28d | %-10d |\n", name3, type3, parts3, price3);
    printf("|--------------------------------------------------------------------------|\n");
    printf("| Примітка: можливо безкоштовно отримати продукт StarOffice через Internet |\n");
    printf("|--------------------------------------------------------------------------|\n");

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
