// lab3A.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <windows.h>
#include <cmath>
using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    int a, b, c;
    double d, x1, x2;

    while (true) {
        printf("Введіть коефіцієнт a > ");
        if (scanf("%d", &a) != 1) {
            printf("Некоректне введення координати а\n");
            return 1;
        }

        printf("Введіть коефіцієнт b > ");
        if (scanf("%d", &b) != 1) {
            printf("Некоректне введення координати b\n");
            return 1;
        }

        printf("Введіть коефіцієнт c > ");
        if (scanf("%d", &c) != 1) {
            printf("Некоректне введення координати c\n");
            return 1;
        }

        if (a == 0) {
            printf("Це не квадратне рівняння (a = 0)\n");
        }
        else {
            d = b * b - 4 * a * c;

            if (d > 0) {
                x1 = (-b + sqrt(d)) / (2 * a);
                x2 = (-b - sqrt(d)) / (2 * a);
                printf("Рівняння має два дійсних корені:\n");
                printf("x1 = %.2f\n", x1);
                printf("x2 = %.2f\n", x2);
            }
            else if (d == 0) {
                x1 = -b / (2.0 * a);
                printf("Рівняння має один дійсний корінь:\n");
                printf("x = %.2f\n", x1);
            }
            else {
                printf("Рівняння не має дійсних коренів (дискримінант < 0).\n");
            }
        }
    }
    return 0;
} 


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
