// lab1 sek v gody.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
// task 5 sek v gody

#include <iostream>
using namespace std;

int main()
{
    const int days = 365;
    const int hours = 24;
    const int minutes = 60;
    const int seconds = 60;

    unsigned long long sec_in_year = (unsigned long long)days * hours * minutes * seconds;

    unsigned long long years = 1;
    unsigned long long total_seconds;

    while (true) {
        total_seconds = sec_in_year * years;
        years *= 10; 
    }

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
