// Lab4A.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    srand((unsigned)time(NULL));

    int x, n;

    x = rand() % 100 + 1;

    printf("Комп'ютер загадав число від 1 до 100.\n");
    printf("Спробуйте його відгадати\n");

    for (int i = 1; ; i++)
    {
        printf("Спроба %d. Введіть число > ", i);
        if (scanf("%d", &n) != 1) {
            printf("Некоректне введення числа\n");
            return 1;
        }

        if (n > x)
            printf("Менше\n");
        else if (n < x)
            printf("Більше\n");
        else
        {
            printf("Ви відгадали число\n");
            printf("Кількість спроб: %d\n", i);
            break;
        }
    }

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
