// Lab3Б.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <stdio.h>
#include <windows.h>
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	
	int n; 

	while (true) {
		printf("Введіть кількість грибів n > ");
		if (scanf("%d", &n) != 1 || n <= 0) {
			printf("Некоректне введення числа n\n");
			return 1;
		}

        if (n % 100 >= 11 && n % 100 <= 14) {
            printf("%d грибів\n", n);
        }
        else {
            switch (n % 10) {
            case 1:
                printf("%d гриб\n", n);
                break;
            case 2:
            case 3:
            case 4:
                printf("%d гриба\n", n);
                break;
            default:
                printf("%d грибів\n", n);
                break;
            }
        }
    }

    return 0;
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
